index.html
<!DOCTYPE html>
<html>
<head>
<title>ng-computed</title>
<!-- 2014-06-04 Wed 18:05 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="Carlo Zancanaro">
<link rel="stylesheet" type="text/css" href="stylesheets/styles.css"></head>
<body>
<div id="preamble" class="status">
<a href="index.html">Introduction</a><a href="pages/installation.html">Installation</a><a href="pages/debug.html">Debug</a>
</div>
<div id="content">
<h1 class="title">ng-computed</h1>
<p>
Computed properties for <a href="http://angularjs.org/">AngularJS</a>, à la <a href="http://knockoutjs.com/">Knockout JS</a>.
</p>

<div class="org-src-container">

<pre class="src src-sh">bower install ng-computed
</pre>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Motivation</h2>
<div class="outline-text-2" id="text-1">
<p>
When writing applications within the AngularJS framework, it is often
necessary to compute values for scope properties which are dependent
on other scope values. AngularJS provides a basic mechanism to keep
these values up to date (<code>$watch</code>, and its variants), but these can
often become unwieldy as your dependencies become more complex or
dynamic.
</p>

<p>
This is the problem that <code>ng-computed</code> is aiming to solve. Within a
<code>$computed</code> value's body it is not necessary to explicitly declare
what values you depend on, or when this value should be
re-evaluated. <code>ng-computed</code> will take care of all the details so you
can focus on your actual computation.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Hello World Example</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">

<pre class="src src-html-example" id="hello-world-html">&lt;<span style="color: #268bd2;">div</span> <span style="color: #268bd2;">ng-app</span>=<span style="color: #2aa198;">"hello-world-example"</span>&gt;
  &lt;<span style="color: #268bd2;">table</span> <span style="color: #268bd2;">ng-controller</span>=<span style="color: #2aa198;">"HelloWorldController"</span>&gt;
    &lt;<span style="color: #268bd2;">tr</span>&gt;
      &lt;<span style="color: #268bd2;">td</span>&gt;$scope.hello&lt;/<span style="color: #268bd2;">td</span>&gt;
      &lt;<span style="color: #268bd2;">td</span>&gt;&lt;<span style="color: #268bd2;">input</span> <span style="color: #268bd2;">type</span>=<span style="color: #2aa198;">"text"</span> <span style="color: #268bd2;">ng-model</span>=<span style="color: #2aa198;">"hello"</span>&gt;&lt;/<span style="color: #268bd2;">td</span>&gt;
    &lt;/<span style="color: #268bd2;">tr</span>&gt;
    &lt;<span style="color: #268bd2;">tr</span>&gt;
      &lt;<span style="color: #268bd2;">td</span>&gt;$scope.world&lt;/<span style="color: #268bd2;">td</span>&gt;
      &lt;<span style="color: #268bd2;">td</span>&gt;&lt;<span style="color: #268bd2;">input</span> <span style="color: #268bd2;">type</span>=<span style="color: #2aa198;">"text"</span> <span style="color: #268bd2;">ng-model</span>=<span style="color: #2aa198;">"world"</span>&gt;&lt;/<span style="color: #268bd2;">td</span>&gt;
    &lt;/<span style="color: #268bd2;">tr</span>&gt;
    &lt;<span style="color: #268bd2;">tr</span>&gt;
      &lt;<span style="color: #268bd2;">td</span>&gt;$scope.helloWorld&lt;/<span style="color: #268bd2;">td</span>&gt;
      &lt;<span style="color: #268bd2;">td</span>&gt;{{helloWorld}}&lt;/<span style="color: #268bd2;">td</span>&gt;
    &lt;/<span style="color: #268bd2;">tr</span>&gt;
  &lt;/<span style="color: #268bd2;">table</span>&gt;
&lt;/<span style="color: #268bd2;">div</span>&gt;
</pre>
</div>

<div class="org-src-container">

<pre class="src src-js-example" id="hello-world-js">angular.module(<span style="color: #2aa198;">'hello-world-example'</span>, [<span style="color: #2aa198;">'ngComputed'</span>, <span style="color: #2aa198;">'ng'</span>])
    .controller(<span style="color: #2aa198;">'HelloWorldController'</span>, <span style="color: #859900;">function</span>(<span style="color: #268bd2;">$scope</span>, <span style="color: #268bd2;">$computed</span>, <span style="color: #268bd2;">$trackedEval</span>) {
        angular.extend($scope, {$computed: $computed, $eval: $trackedEval});
        $scope.hello = <span style="color: #2aa198;">"hello"</span>;
        $scope.world = <span style="color: #2aa198;">"world"</span>;
        $scope.$computed(<span style="color: #2aa198;">"helloWorld"</span>, <span style="color: #859900;">function</span>() {
            <span style="color: #859900;">return</span> $scope.$eval(<span style="color: #2aa198;">"hello"</span>) + <span style="color: #2aa198;">", "</span> + $scope.$eval(<span style="color: #2aa198;">"world"</span>) + <span style="color: #2aa198;">"!"</span>;
        });
    });
</pre>
</div>

<p>
<code>$scope.helloWorld</code> will be kept updated by the usual AngularJS watch
mechanisms, and it will be recalculated whenever the values of
<code>$scope.hello</code> or <code>$scope.world</code> change.
</p>

<p>
Here's that example in action:
</p>

<div ng-app="hello-world-example">
  <table ng-controller="HelloWorldController">
    <tr>
      <td>$scope.hello</td>
      <td><input type="text" ng-model="hello"></td>
    </tr>
    <tr>
      <td>$scope.world</td>
      <td><input type="text" ng-model="world"></td>
    </tr>
    <tr>
      <td>$scope.helloWorld</td>
      <td>{{helloWorld}}</td>
    </tr>
  </table>
</div>
<script>
(function(){angular.module('hello-world-example', ['ngComputed', 'ng'])
    .controller('HelloWorldController', function($scope, $computed, $trackedEval) {
        angular.extend($scope, {$computed: $computed, $eval: $trackedEval});
        $scope.hello = "hello";
        $scope.world = "world";
        $scope.$computed("helloWorld", function() {
            return $scope.$eval("hello") + ", " + $scope.$eval("world") + "!";
        });
    });})()
</script>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Carlo Zancanaro (<a href="mailto:carlo@clearboxsystems.com.au">carlo@clearboxsystems.com.au</a>)</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.6)</p>
<p class="github-link"><a href="https://github.com/ClearboxSystems/ng-computed">On Github</a></p>
</div>
</body>
</html>
